wsdl/ws.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="ActivitySvc" targetNamespace="http://www.gratex.com/PerConIk/IActivitySvc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.gratex.com/PerConIk/IActivitySvc" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsp:Policy wsu:Id="BasicHttpBinding_IActivitySvc_policy"><wsp:ExactlyOne><wsp:All><http:NegotiateAuthentication xmlns:http="http://schemas.microsoft.com/ws/06/2004/policy/http"/></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xsd:schema targetNamespace="http://www.gratex.com/PerConIk/IActivitySvc/Imports"><xsd:import schemaLocation="http://perconik.fiit.stuba.sk/UserActivity/ActivitySvc.svc?xsd=xsd0" namespace="http://www.gratex.com/PerConIk/IActivitySvc"/><xsd:import schemaLocation="http://perconik.fiit.stuba.sk/UserActivity/ActivitySvc.svc?xsd=xsd1" namespace="http://microsoft.com/wsdl/types/"/></xsd:schema></wsdl:types><wsdl:message name="IActivitySvc_CommitActivity_InputMessage"><wsdl:part name="parameters" element="tns:CommitActivity"/></wsdl:message><wsdl:message name="IActivitySvc_CommitActivity_OutputMessage"><wsdl:part name="parameters" element="tns:CommitActivityResponse"/></wsdl:message><wsdl:message name="IActivitySvc_GetActivity_InputMessage"><wsdl:part name="parameters" element="tns:GetActivity"/></wsdl:message><wsdl:message name="IActivitySvc_GetActivity_OutputMessage"><wsdl:part name="parameters" element="tns:GetActivityResponse"/></wsdl:message><wsdl:message name="IActivitySvc_GetActivities_InputMessage"><wsdl:part name="parameters" element="tns:GetActivities"/></wsdl:message><wsdl:message name="IActivitySvc_GetActivities_OutputMessage"><wsdl:part name="parameters" element="tns:GetActivitiesResponse"/></wsdl:message><wsdl:portType name="IActivitySvc"><wsdl:operation name="CommitActivity"><wsdl:input wsaw:Action="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/CommitActivity" message="tns:IActivitySvc_CommitActivity_InputMessage"/><wsdl:output wsaw:Action="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/CommitActivityResponse" message="tns:IActivitySvc_CommitActivity_OutputMessage"/></wsdl:operation><wsdl:operation name="GetActivity"><wsdl:input wsaw:Action="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/GetActivity" message="tns:IActivitySvc_GetActivity_InputMessage"/><wsdl:output wsaw:Action="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/GetActivityResponse" message="tns:IActivitySvc_GetActivity_OutputMessage"/></wsdl:operation><wsdl:operation name="GetActivities"><wsdl:input wsaw:Action="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/GetActivities" message="tns:IActivitySvc_GetActivities_InputMessage"/><wsdl:output wsaw:Action="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/GetActivitiesResponse" message="tns:IActivitySvc_GetActivities_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_IActivitySvc" type="tns:IActivitySvc"><wsp:PolicyReference URI="#BasicHttpBinding_IActivitySvc_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="CommitActivity"><soap:operation soapAction="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/CommitActivity" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetActivity"><soap:operation soapAction="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/GetActivity" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetActivities"><soap:operation soapAction="http://www.gratex.com/PerConIk/IActivitySvc/IActivitySvc/GetActivities" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="ActivitySvc"><wsdl:port name="BasicHttpBinding_IActivitySvc" binding="tns:BasicHttpBinding_IActivitySvc"><soap:address location="http://perconik.fiit.stuba.sk/UserActivity/ActivitySvc.svc"/></wsdl:port></wsdl:service></wsdl:definitions>