wsdl/com/req

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iac="http://www.gratex.com/PerConIk/IActivitySvc">
   <soapenv:Header/>
   <soapenv:Body>
      <iac:GetActivities>
         <!--Optional:-->
         <iac:filter>
            <iac:StartTimeFrom>2013-11-06T20:00:45</iac:StartTimeFrom>
            <iac:StartTimeTo>2013-12-19T01:18:33</iac:StartTimeTo>

            <iac:User>TFS\xcervenovad</iac:User>

            <iac:PageSize>500</iac:PageSize>
            <!--Optional:-->
            <iac:EventShortTypeNames>
               <!--Zero or more repetitions:-->
               <iac:string>IdeCodeOperation</iac:string>
            </iac:EventShortTypeNames>
         </iac:filter>
      </iac:GetActivities>
   </soapenv:Body>
</soapenv:Envelope>